//***************************************************************************
//                 	  Драйвер сенсорных кнопок
//                   		  v 1.0
//                  Copyright (c) Кизим Игорь aka Igoryosha
//			  Website : lobotryasy.net 
//***************************************************************************
#ifndef	sens_h
#define	sens_h

#include <avr/io.h>

//====================================================
//Порт, к которому подключены сенсорные кнопки
#define TOUCH_PORT  	PORTC
#define TOUCH_DDR   	DDRC
#define TOUCH_PIN   	PINC
#define	TOUCH_FIRST_PIN	2

#define NUM_KEY   3 //Количество сенсорных кнопок (кнопки подключаются, начиная с нулевого порта!)
//====================================================

/*Перед основным циклом while (1) необходимо определить опорное время заряда 
ёмкости сенсорных кнопок, вставляя в программу TOUCH_Scan (RefVal); */

//===============================================================
//Инициализация входов микроконтроллера
//===============================================================
void TOUCH_Init();

//===============================================================
//   Функция подсчёта времени заряда ёмкости сенсорной кнопки
//===============================================================
int TOUCH_Buttons(uint8_t channel);

//===============================================================
//Функция подсчёта времени заряда ёмкости сенсорных кнопок в относительных единицах
//===============================================================
void TOUCH_Scan(uint16_t *array);

//===============================================================
// Функция опроса сенсорных кнопок и определение нажатой кнопки
// Вставляется в основном цикле программы
//===============================================================
uint8_t TOUCH_CompareKey();

//===============================================================
//        Функция возврата кода нажатой сенсорной кнопки
//===============================================================
char TOUCH_GetKey();

#endif  //sens_h
